# Evaluate Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeEndPoint..::..Evaluate Method
EdgeEndPoint Class See Also
---
Evaluate the end point of the edge in 3d coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public XYZ Evaluate()
```

Visual Basic
---
```text
Public Function Evaluate As XYZ
```

Visual C++
---
```text
public:
XYZ^ Evaluate()
```

# ### Return Value
The end point of the edge in 3d coordinates.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Failed to evaluate the end point of the edge. |

# See Also
EdgeEndPoint Class
Autodesk.Revit.DB Namespace